TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2022(2023) Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_usb_usbx_port.c
 * Description  : USB Peripheral standard request code
 ***********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *         : 30.06.2022 1.40 USBX PCDC is supported.
 *         : 30.10.2022 1.41 USBX HMSC is supported.
 *         : 30.09.2023 1.42 USBX HCDC is supported.
 ***********************************************************************************************************************/

/******************************************************************************
 * Includes   <System Includes> , "Project Includes"
 ******************************************************************************/

#include <r_usb_basic_if.h>
#include <string.h>
#include "r_usb_typedef.h"
#include "r_usb_extern.h"
#include "r_usb_bitdefine.h"
#include "r_usb_reg_access.h"
#include "r_rtos_abstract.h"

#if (BSP_CFG_RTOS_USED == 5)    /* Azure RTOS */
 #include "ux_api.h"
 #include "ux_system.h"
 #include "ux_utility.h"
 #include "ux_device_stack.h"

 #if defined(USB_CFG_PMSC_USE)
  #include "r_usb_pmsc_cfg.h"
  #include "ux_device_class_storage.h"
  #include "rm_block_media_api.h"
 #endif                                /* defined(USB_CFG_PMSC_USE) */

 #if defined(USB_CFG_HHID_USE)
  #include "r_usb_hhid_cfg.h"
 #endif                                /* defined(USB_CFG_HHID_USE) */

 #if defined(USB_CFG_HCDC_USE)
  #include "ux_host_class_cdc_acm.h"
  #define USB_MAX_CONNECT_DEVICE_NUM    2
 #endif                                /* defined(USB_CFG_HCDC_USE) */

 #if defined(USB_CFG_PHID_USE)
  #include "r_usb_phid_cfg.h"
 #endif                                /* defined(USB_CFG_HHID_USE) */

 #if defined(USB_CFG_HPRN_USE)
  #include "ux_host_class_printer.h"
 #endif                                /* defined(USB_CFG_HPRN_USE) */

 #if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
  #include "ux_host_stack.h"
 #endif                                /* #if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST) */

/*******************************************************************************
 * Macro definitions
 ******************************************************************************/
 #define VALUE_1000UL                      (1000UL)
 #if defined(USB_CFG_HHID_USE)
  #define UX_PORT_HC_AVAILABLE_BANDWIDTH    (2322UL)
 #else
  #define UX_PORT_HC_AVAILABLE_BANDWIDTH    (2304UL)
 #endif                                /* defined(USB_CFG_HHID_USE) */
 #define UX_PORT_MAX_BULK_PAYLOAD           (512UL)
 #define UX_PORT_MAX_INTERRUPT_PAYLOAD      (512UL)
 #define UX_PORT_MAX_CONTROL_PAYLOAD        (512UL)
 #define UX_PORT_MAX_ISO_PAYLOAD            (512UL)

 #define UX_PORT_MAX_SELF_POWER             (500U / 2)
 #define UX_PORT_MASK_ENDPOINT_TYPE         (3U)
 #define UX_PORT_CONTROL_ENDPOINT           (0U)
 #define UX_PORT_SET_CONFIGURATION          (9U)
 #define UX_PORT_SETUP_REQUEST_TYPE         (0U)
 #define UX_PORT_BULK_ENDPOINT              (2U)
 #define UX_PORT_INTERRUPT_ENDPOINT         (3U)
 #define UX_PORT_ISOCHRONOUS_ENDPOINT       (1U)

 #define USB_PERI_USBX_REMOVABLE_MEDIA     (0x80U)

/******************************************************************************
 * Private global variables and functions
 ******************************************************************************/
 #if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
static UINT     usb_peri_usbx_to_basic(UX_SLAVE_DCD * dcd, UINT function, VOID * parameter);
static void     usb_peri_usbx_transfer_complete_cb(usb_utr_t * p_mess, uint16_t data1, uint16_t data2);
static usb_err_t    usb_peri_usbx_initialize_common(uint32_t dcd_io);
static void         usb_peri_usbx_initialize_common_complete(void);

static ULONG * g_p_usb_actural_length[USB_MAX_PIPE_NO + 1U];
  #if defined(USB_CFG_PMSC_USE)
static UX_SLAVE_CLASS_STORAGE_PARAMETER g_usb_peri_usbx_pmsc_parameter;
static uint32_t g_media_total_sector;
static uint32_t g_media_sector_size_bytes;
static bool     g_media_write_protected = 0;
static rm_block_media_instance_t * gp_block_media_instance;
volatile bool        g_blockmedia_complete_event     = false;
static volatile bool g_blockmedia_poll_status_events = false;
static volatile bool g_status_busy = false;

static UINT usb_peri_usbx_media_read(VOID  * storage,
                                     ULONG   lun,
                                     UCHAR * data_pointer,
                                     ULONG   number_blocks,
                                     ULONG   lba,
                                     ULONG * media_status);
static UINT usb_peri_usbx_media_write(VOID  * storage,
                                      ULONG   lun,
                                      UCHAR * data_pointer,
                                      ULONG   number_blocks,
                                      ULONG   lba,
                                      ULONG * media_status);
static UINT usb_peri_usbx_media_status(VOID * storage, ULONG lun, ULONG media_id, ULONG * media_status);
static void usb_peri_usbx_pmsc_storage_init(void);
static void usb_peri_usbx_pmsc_storage_uninit(void);

  #endif                               /* defined(USB_CFG_PMSC_USE) */
 #endif                                /* #if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI) */

