TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
 #if defined(USB_CFG_OTG_USE)
static UINT usb_otg_hnp_swap(ULONG type);
static UINT usb2_otg_hnp_swap(ULONG type);

 #endif                                /* defined(USB_CFG_OTG_USE) */

 #if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
static uint8_t      usb_host_usbx_endpoint_to_pipe(uint8_t module_number, uint8_t ep_number);
static void         usb_host_usbx_configured(usb_utr_t * p_utr, uint16_t devadr, uint16_t data2);
static void         usb_host_usbx_set_pipe_registration(usb_utr_t * ptr, uint16_t dev_addr);
static void         usb_host_usbx_detach(usb_utr_t * p_utr, uint16_t devadr, uint16_t data2);
static void         usb_host_usbx_init(usb_utr_t * p_utr, uint16_t data1, uint16_t data2);
static void         usb_host_usbx_class_check(usb_utr_t * p_utr, uint16_t ** table);
static uint32_t     usb_host_usbx_get_speed(UX_HCD * hcd);
static UINT         usb_host_usbx_to_basic(UX_HCD * hcd, UINT function, VOID * parameter);
static void         usb_host_usbx_initialize_common_complete(UX_HCD * hcd);
static UINT    		usb_host_usbx_initialize_common(UX_HCD * hcd);

static uint16_t  g_usb_host_usbx_request[USB_NUM_USBIP][5];
static usb_utr_t g_usb_host_usbx_req_msg[USB_NUM_USBIP];

static uint32_t * g_p_usb_host_actural_length[USB_NUM_USBIP][USB_MAX_PIPE_NO + 1U];

static UX_TRANSFER * g_p_usb_host_usbx_transfer_request[USB_NUM_USBIP][USB_MAX_PIPE_NO + 1U];

static const uint16_t g_usb_host_usbx_device_tpl[] =
{
    USB_CFG_TPLCNT,                    /* Number of tpl table */
    0,                                 /* Reserved */
    USB_CFG_TPL                        /* Vendor ID, Product ID */
};
 #endif                                /* #if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST) */

/******************************************************************************
 * Exported global variables (to be accessed by other files)
 ******************************************************************************/
 #if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
uint32_t    usb_peri_usbx_remote_wakeup(uint8_t module_number);
usb_err_t   usb_peri_usbx_pmsc_media_initialize(void const * p_context);
void        usb_peri_usbx_set_control_length(usb_setup_t * p_req);

bool        g_usb_peri_usbx_is_detach[USB_MAX_PIPE_NO + 1];

  #if defined(USB_CFG_PMSC_USE)
usb_err_t   usb_peri_usbx_media_initialize(void const * p_context);
usb_err_t   usb_peri_usbx_media_close(void);
void        r_usb_pmsc_block_media_event_callback(rm_block_media_callback_args_t * p_args);

volatile bool g_card_inserted = false;

  #endif                               /* defined(USB_CFG_PMSC_USE) */
 #endif                                /* #if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI) */

 #if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
UX_DEVICE  * g_p_usbx_device[USB_NUM_USBIP];
rtos_sem_id_t g_usb_host_usbx_sem[USB_NUM_USBIP][USB_MAX_PIPE_NO + 1];

  #if defined(USB_CFG_HMSC_USE)
static uint16_t             g_usb_hmsc_in_pipectr[USB_NUM_USBIP][1];  /* Pipectr(SQTGL) */
static uint16_t             g_usb_hmsc_out_pipectr[USB_NUM_USBIP][1]; /* Pipectr(SQTGL) */
static usb_pipe_table_reg_t g_usb_hmsc_pipe_table[1][USB_PIPE_DIR_MAX];
static uint16_t             g_usb_hmsc_in_pipe[USB_NUM_USBIP][1];
static uint16_t             g_usb_hmsc_out_pipe[USB_NUM_USBIP][1];
   #if (USB_CFG_DMA == USB_CFG_ENABLE)
static void * g_p_usbx_hmsc_dma_buf[USB_MAXDEVADDR] = {0};
   #endif                              /* #if (USB_CFG_DMA == USB_CFG_ENABLE) */
  #endif /* #if defined(USB_CFG_HMSC_USE) */
 #endif                                /* #if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST) */

 #if defined(USB_CFG_OTG_USE)
uint8_t g_usb_otg_hnp_process[USB_NUM_USBIP] =
{
    USB_OFF,
  #if USB_NUM_USBIP == 2
    USB_OFF
  #endif
};
 #endif                                /* defined(USB_CFG_OTG_USE) */

 #if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
extern const uint16_t USB_CFG_TPL_TABLE[];
 #endif /* #if USB_CFG_COMPLIANCE == USB_CFG_ENABLE */

 #if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)

/******************************************************************************
 * Function Name   : usb_peri_usbx_initialize
 * Description     : Initialization processing
 * Argument        : uint32_t dcd_io : Address of USB module 0 or USB module 1
 * Return          : USB_SUCCESS / USB_ERR_NG
 ******************************************************************************/
usb_err_t usb_peri_usbx_initialize (uint32_t dcd_io)
{
    usb_err_t status;

  #if defined(USB_CFG_PMSC_USE)
    usb_peri_usbx_pmsc_storage_init();
  #endif                               /* defined(USB_CFG_PMSC_USE) */

    status = usb_peri_usbx_initialize_common(dcd_io);
    if (USB_SUCCESS == status)
    {
        usb_peri_usbx_initialize_common_complete();
    }

    return status;
}                                      /* End of function usb_peri_usbx_initialize() */

/******************************************************************************
 * Function Name   : usb_peri_usbx_uninitialize
 * Description     : Uninitialization processing
 * Argument        : uint32_t dcd_io : Address of USB module 0 or USB module 1
 * Return          : USB_SUCCESS
 ******************************************************************************/
usb_err_t usb_peri_usbx_uninitialize (uint32_t dcd_io)
{
    UX_SLAVE_DCD * dcd;

  #if defined(R_USB_HS0_BASE)
    if ((dcd_io != R_USB_HS0_BASE) && (dcd_io != R_USB_FS0_BASE))
  #else
    if (dcd_io != R_USB_FS0_BASE)
  #endif
    {
        return USB_ERR_NG;
    }

    dcd = &_ux_system_slave->ux_system_slave_dcd;

    dcd->ux_slave_dcd_status   = (uint32_t) UX_UNUSED;
    dcd->ux_slave_dcd_io       = 0U;
    dcd->ux_slave_dcd_function = UX_NULL;

  #if defined(USB_CFG_PMSC_USE)
    usb_peri_usbx_pmsc_storage_uninit();
  #endif                               /* defined(USB_CFG_PMSC_USE) */

    return USB_SUCCESS;
}                                      /* End of function usb_peri_usbx_uninitialize() */

/******************************************************************************
 * Function Name   : usb_peri_usbx_initialize_common
 * Description     : Initialization processing
 * Argument        : uint32_t dcd_io : Address of USB module 0 or USB module 1
 * Return          : UX_SUCCESS
 ******************************************************************************/
static usb_err_t usb_peri_usbx_initialize_common (uint32_t dcd_io)
{
    UX_SLAVE_DCD * dcd;

    /* Get the pointer to the DCD.  */
    dcd = &_ux_system_slave->ux_system_slave_dcd;

    /* Save the base address of the controller.  */
    dcd->ux_slave_dcd_io = dcd_io;

    dcd->ux_slave_dcd_function = usb_peri_usbx_to_basic;

    /* Return successful completion.  */
    return USB_SUCCESS;
}                                      /* End of function usb_peri_usbx_initialize_common() */

