TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
/******************************************************************************
 * Function Name   : usb_peri_usbx_initialize_common_complete
 * Description     : Initialization processing
 * Argument        : None
 * Return          : None
 ******************************************************************************/
static void usb_peri_usbx_initialize_common_complete (void)
{
    UX_SLAVE_DCD * dcd = &_ux_system_slave->ux_system_slave_dcd;

    dcd->ux_slave_dcd_status = (uint32_t) UX_DCD_STATUS_OPERATIONAL;
}                                      /* End of function usb_peri_usbx_initialize_common_complete() */

/******************************************************************************
 * Function Name   : usb_peri_usbx_initialize_complete
 * Description     : Initialization processing
 * Argument        : None
 * Return          : None
 ******************************************************************************/
usb_err_t usb_peri_usbx_initialize_complete (void)
{
    UX_SLAVE_DCD      * dcd;
    UX_SLAVE_DEVICE   * device;
    uint8_t           * device_framework;
    UX_SLAVE_TRANSFER * transfer_request;

    /* Get the pointer to the DCD.  */
    dcd = &_ux_system_slave->ux_system_slave_dcd;

    /* Get the pointer to the device.  */
    device = &_ux_system_slave->ux_system_slave_device;

    /* Check the speed and set the correct descriptor.  */
    if (_ux_system_slave->ux_system_slave_speed == (uint32_t) UX_FULL_SPEED_DEVICE)
    {
        /* The device is operating at full speed.  */
        _ux_system_slave->ux_system_slave_device_framework =
            _ux_system_slave->ux_system_slave_device_framework_full_speed;
        _ux_system_slave->ux_system_slave_device_framework_length =
            _ux_system_slave->ux_system_slave_device_framework_length_full_speed;
    }
    else
    {
        /* The device is operating at high speed.  */
        _ux_system_slave->ux_system_slave_device_framework =
            _ux_system_slave->ux_system_slave_device_framework_high_speed;
        _ux_system_slave->ux_system_slave_device_framework_length =
            _ux_system_slave->ux_system_slave_device_framework_length_high_speed;
    }

    /* Get the device framework pointer.  */
    device_framework = _ux_system_slave->ux_system_slave_device_framework;

    /* And create the decompressed device descriptor structure.  */
    _ux_utility_descriptor_parse(device_framework,
                                 (uint8_t *) _ux_system_device_descriptor_structure,
                                 (uint32_t) UX_DEVICE_DESCRIPTOR_ENTRIES,
                                 (uint8_t *) (&device->ux_slave_device_descriptor));

    /* Now we create a transfer request to accept the first SETUP packet
     * and get the ball running. First get the address of the endpoint
     * transfer request container.  */
    transfer_request = &device->ux_slave_device_control_endpoint.ux_slave_endpoint_transfer_request;

    /* Set the timeout to be for Control Endpoint.  */
    transfer_request->ux_slave_transfer_request_timeout =
        (((uint32_t) (UX_CONTROL_TRANSFER_TIMEOUT_IN_MS) *(uint32_t) (UX_PERIODIC_RATE)) / VALUE_1000UL);

    /* Adjust the current data pointer as well.  */
    transfer_request->ux_slave_transfer_request_current_data_pointer =
        transfer_request->ux_slave_transfer_request_data_pointer;

    /* Update the transfer request endpoint pointer with the default endpoint.  */
    transfer_request->ux_slave_transfer_request_endpoint = &device->ux_slave_device_control_endpoint;

    /* The control endpoint max packet size needs to be filled manually in its descriptor.  */
    transfer_request->ux_slave_transfer_request_endpoint->ux_slave_endpoint_descriptor.wMaxPacketSize =
        device->ux_slave_device_descriptor.bMaxPacketSize0;

    /* On the control endpoint, always expect the maximum.  */
    transfer_request->ux_slave_transfer_request_requested_length =
        device->ux_slave_device_descriptor.bMaxPacketSize0;

    /* Attach the control endpoint to the transfer request.  */
    transfer_request->ux_slave_transfer_request_endpoint = &device->ux_slave_device_control_endpoint;

    /* Create the default control endpoint attached to the device.
     * Once this endpoint is enabled, the host can then send a setup packet
     * The device controller will receive it and will call the setup function
     * module.  */
    dcd->ux_slave_dcd_function(dcd, UX_DCD_CREATE_ENDPOINT, (void *) &device->ux_slave_device_control_endpoint);

    /* Ensure the control endpoint is properly reset.  */
    device->ux_slave_device_control_endpoint.ux_slave_endpoint_state = (uint32_t) UX_ENDPOINT_RESET;

    /* A SETUP packet is a DATA IN operation.  */
    transfer_request->ux_slave_transfer_request_phase = (uint32_t) UX_TRANSFER_PHASE_DATA_IN;

    /* Check the status change callback.  */
    if (_ux_system_slave->ux_system_slave_change_function != UX_NULL)
    {
        /* Inform the application if a callback function was programmed.  */
        _ux_system_slave->ux_system_slave_change_function(UX_DEVICE_ATTACHED);
    }

    /* We are now ready for the USB device to accept the first packet when connected.  */
    return USB_SUCCESS;
}                                      /* End of function usb_peri_usbx_initialize_complete() */

  #if defined(USB_CFG_PAUD_USE)

/******************************************************************************
 * Function Name   : usb_peri_usbx_set_control_length
 * Description     :
 * Argument        : usb_setup_t  *p_req        : Pointer to usb_utr_t structure
 * Return          : none
 ******************************************************************************/
void usb_peri_usbx_set_control_length (usb_setup_t * p_req)
{
    *g_p_usb_actural_length[USB_PIPE0] = p_req->request_length;
}                                      /* End of function usb_peri_usbx_set_control_length() */

  #endif /* #if defined(USB_CFG_PAUD_USE) */

/******************************************************************************
 * Function Name   : usb_peri_usbx_transfer_complete_cb
 * Description     : CallBack Function called when the data transfer completion
 * Argument        : usb_utr_t  *p_mess         : Pointer to usb_utr_t structure
 *                 : uint16_t   data1           : Not used
 *                 : uint16_t   data2           : Not used
 * Return          : none
 ******************************************************************************/
static void usb_peri_usbx_transfer_complete_cb (usb_utr_t * p_mess, uint16_t data1, uint16_t data2)
{
    uint16_t pipe;
    uint16_t pipe_reg;

