TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
    pipe = p_mess->keyword;

    tx_semaphore_put(&g_usb_peri_usbx_sem[pipe]);

    hw_usb_write_pipesel(USB_NULL, pipe);
    pipe_reg = hw_usb_read_pipecfg(USB_NULL);

    if (0 != (pipe_reg & USB_DIRFIELD))
    {
        /* transmission */
        *g_p_usb_actural_length[pipe] = p_mess->read_req_len;
    }
    else
    {
        /* reception */
        *g_p_usb_actural_length[pipe] = p_mess->read_req_len - p_mess->tranlen;
    }
}                                      /* End of function usb_peri_usbx_transfer_complete_cb() */

/******************************************************************************
 * Function Name   : usb_peri_usbx_to_basic
 * Description     : Porting Layer from USBX to USB basic driver
 * Argument        : UX_SLAVE_DCD *dcd  :
 *                 : UINT function      :
 *                 : VOID *parameter    :
 * Return          : UX_SUCCESS / UX_TRANSFER_ERROR / UX_CONTROLLER_UNKNOWN
 ******************************************************************************/
static UINT usb_peri_usbx_to_basic (UX_SLAVE_DCD * dcd, UINT function, VOID * parameter)
{
    volatile uint32_t   status = (uint32_t) UX_SUCCESS;
    UX_SLAVE_ENDPOINT * endpoint;
    UX_SLAVE_TRANSFER * transfer_request;
    usb_utr_t           tran_data;
    uint32_t            size;
    uint16_t            pipe = 0;
    usb_er_t            err;
    uint8_t             module_number;
    uint32_t            endpoint_index;

    /* Check the status of the controller.  */
    if (dcd->ux_slave_dcd_status == (uint32_t) UX_UNUSED)
    {
        return (uint32_t) UX_CONTROLLER_UNKNOWN;
    }

    module_number = USB_CFG_IP0;
  #if defined(R_USB_HS0_BASE)
    if (R_USB_HS0_BASE == dcd->ux_slave_dcd_io)
    {
        module_number = USB_CFG_IP1;
    }
  #endif                               /* defined(R_USB_HS0_BASE) */
    tran_data.ip = module_number;

    /* Look at the function and route it.  */
    switch (function)
    {
        case (uint32_t) UX_DCD_GET_FRAME_NUMBER:
        {
            status = (uint32_t) UX_SUCCESS;
            break;
        }

        case (uint32_t) UX_DCD_TRANSFER_REQUEST:
        {
            transfer_request = (UX_SLAVE_TRANSFER *) parameter;
            endpoint         = transfer_request->ux_slave_transfer_request_endpoint;
            endpoint_index   = endpoint->ux_slave_endpoint_descriptor.bEndpointAddress;
            if (0 != endpoint_index)
            {
                pipe = usb_pstd_epadr2pipe((uint16_t) endpoint_index);
            }
            else
            {
                pipe = USB_PIPE0;
  #if defined(USB_CFG_PAUD_USE)
                if ((transfer_request->ux_slave_transfer_request_setup[0] & UX_ENDPOINT_DIRECTION) == UX_ENDPOINT_IN)
                {
                    transfer_request->ux_slave_transfer_request_phase = UX_TRANSFER_PHASE_DATA_OUT;
                }
                else
                {
                    transfer_request->ux_slave_transfer_request_phase = UX_TRANSFER_PHASE_DATA_IN;
                }
  #endif                                                                         /* #if defined(USB_CFG_PAUD_USE) */
            }

            size = transfer_request->ux_slave_transfer_request_requested_length; /* Save Read Request Length */
            g_p_usb_actural_length[pipe] = &(transfer_request->ux_slave_transfer_request_actual_length);

            if (pipe != USB_PIPE0)
            {
                tran_data.read_req_len = size;
                tran_data.keyword      = pipe;                                                     /* Pipe Number */
                tran_data.p_tranadr    = transfer_request->ux_slave_transfer_request_data_pointer; /* Data address */
                tran_data.tranlen      = size;                                                     /* Data Size */
                tran_data.complete     = usb_peri_usbx_transfer_complete_cb;                       /* Callback function */
                err = usb_pstd_transfer_start(&tran_data);

                if (USB_OK == err)
                {
                    if (USB_YES == g_usb_peri_usbx_is_detach[pipe])
                    {
                        g_usb_peri_usbx_is_detach[pipe] = USB_NO;
  #if defined(USB_CFG_PMSC_USE)
                        if ((USB_CFG_PMSC_BULK_IN == pipe) || (USB_CFG_PMSC_BULK_OUT == pipe))
                        {
                            status = (uint32_t) UX_TRANSFER_ERROR;
                        }
                        else
                        {
                            status = (uint32_t) UX_SUCCESS;
                        }

  #elif defined(USB_CFG_PHID_USE)
                        if (USB_CFG_PHID_INT_OUT == pipe)
                        {
                            status = (uint32_t) UX_TRANSFER_ERROR;
                        }
                        else
                        {
                            status = (uint32_t) UX_SUCCESS;
                        }

  #else                                /* defined(USB_CFG_PMSC_USE) */
   #if defined(USB_CFG_PCDC_USE)
                        transfer_request->ux_slave_transfer_request_completion_code = UX_TRANSFER_ERROR;
   #endif                              /* defined(USB_PCDC_USE) */
                        status = (uint32_t) UX_SUCCESS;
  #endif /* define(USB_CFG_PMSC_USE */
                    }
                    else
                    {
  #if defined(USB_CFG_PMSC_USE)

                        /*  The error code other UX_SUCCESS must be returned than       *
                         *  when USB peripheral device status is not CONFIGURED status. */
                        uint16_t dvsq;
                        dvsq = hw_usb_read_intsts(module_number);

                        if (USB_DS_CNFG == (dvsq & USB_DVSQ))
                        {
                            status = (uint32_t) UX_SUCCESS;
                        }
                        else
                        {
                            status = (uint32_t) UX_TRANSFER_ERROR;
                        }

  #else                                /* defined(USB_CFG_PMSC_USE) */
   #if defined(USB_CFG_PCDC_USE)
                        transfer_request->ux_slave_transfer_request_completion_code = UX_SUCCESS;
   #endif                              /* defined(USB_PCDC_USE) */
                        status = (uint32_t) UX_SUCCESS;
  #endif /* define(USB_CFG_PMSC_USE */
                    }
                }
                else
                {
                    status = (uint32_t) UX_TRANSFER_ERROR;
                }
            }
            else
            {
                if (transfer_request->ux_slave_transfer_request_phase == UX_TRANSFER_PHASE_DATA_OUT)
                {
                    if (USB_PERI == g_usb_usbmode)
                    {
                        if (USB_YES == g_usb_pstd_pipe0_request)
                        {
                            status = (uint32_t) UX_TRANSFER_ERROR;
                        }

