TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
                        g_usb_pstd_std_request = USB_YES;
                        usb_pstd_ctrl_read(size, transfer_request->ux_slave_transfer_request_data_pointer);
                    }
                }
                else
                {
                    if (USB_PERI == g_usb_usbmode)
                    {
                        {
                            if (USB_ON == g_usb_pstd_pipe0_request)
                            {
                                // return USB_QOVR;
                                status = (uint32_t) UX_TRANSFER_ERROR;
                            }

                            g_usb_pstd_std_request = USB_YES;
                            usb_pstd_ctrl_write(size, transfer_request->ux_slave_transfer_request_data_pointer);
                        }
                    }
                }
            }

            break;
        }

        case (uint32_t) UX_DCD_TRANSFER_ABORT:
  #if defined(USB_CFG_PCDC_USE)
            {
                CHAR         * name;
                ULONG          current_value;
                TX_THREAD    * first_suspended;
                ULONG          suspended_count;
                TX_SEMAPHORE * next_semaphore;

                transfer_request = (UX_SLAVE_TRANSFER *) parameter;
                endpoint         = transfer_request->ux_slave_transfer_request_endpoint;
                endpoint_index   = endpoint->ux_slave_endpoint_descriptor.bEndpointAddress;
                if (0 != endpoint_index)
                {
                    pipe = usb_pstd_epadr2pipe((uint16_t) endpoint_index);
                }

                tx_semaphore_info_get(&g_usb_peri_usbx_sem[pipe],
                                      &name,
                                      &current_value,
                                      &first_suspended,
                                      &suspended_count,
                                      &next_semaphore);

                if (suspended_count == 1)
                {
                    _ux_utility_thread_suspend(first_suspended);
                    tx_semaphore_put(&g_usb_peri_usbx_sem[pipe]);
                }

                break;
            }
  #elif defined(USB_CFG_PPRN_USE)      /* #if defined(USB_CFG_PCDC_USE) */
            {
                for (pipe = USB_MIN_PIPE_NO; pipe < (USB_MAXPIPE_NUM + 1); pipe++)
                {
                    if (USB_TRUE == g_usb_pipe_table[tran_data.ip][pipe].use_flag)
                    {
                        usb_pstd_forced_termination(pipe, (uint16_t) USB_DATA_STOP, &tran_data);
                    }
                }

                break;
            }
  #endif

        case (uint32_t) UX_DCD_CREATE_ENDPOINT:
        {
            break;
        }

        case (uint32_t) UX_DCD_DESTROY_ENDPOINT:
        {
            status = (uint32_t) UX_SUCCESS;
            break;
        }

        case (uint32_t) UX_DCD_RESET_ENDPOINT:
        {
            break;
        }

        case (uint32_t) UX_DCD_STALL_ENDPOINT:
        {
            endpoint       = (UX_SLAVE_ENDPOINT *) parameter;
            endpoint_index = endpoint->ux_slave_endpoint_descriptor.bEndpointAddress;
            if (0 != endpoint_index)
            {
                pipe = usb_pstd_epadr2pipe((uint16_t) endpoint_index);
            }
            else
            {
                pipe = USB_PIPE0;
            }

            usb_pstd_set_stall(pipe);

            status = (uint32_t) UX_SUCCESS;

            break;
        }

        case (uint32_t) UX_DCD_SET_DEVICE_ADDRESS:
        {
            status = (uint32_t) UX_SUCCESS;
            break;
        }

        case (uint32_t) UX_DCD_CHANGE_STATE:
        {
            if (parameter == (void *) UX_DEVICE_REMOTE_WAKEUP)
            {
                /* This function is called when the device wants to wake up the host.  */
                usb_peri_usbx_remote_wakeup(module_number);
            }
            else
            {
                if (parameter == (void *) UX_DEVICE_CONFIGURED)
                {
                    if (UX_NULL != _ux_system_slave->ux_system_slave_change_function)
                    {
                        _ux_system_slave->ux_system_slave_change_function(UX_DEVICE_CONFIGURED);
                    }
                }

                status = (uint32_t) UX_SUCCESS;
            }

            break;
        }

        case (uint32_t) UX_DCD_ENDPOINT_STATUS:
        {
            break;
        }

        default:
        {
            /* If trace is enabled, insert this event into the trace buffer.  */
            status = (uint32_t) UX_FUNCTION_NOT_SUPPORTED;
            break;
        }
    }

    /* Return completion status.  */
    return status;
}                                      /* End of function usb_peri_usbx_to_basic() */

/*******************************************************************************************************************//**
 * Function Name   : usb_peri_usbx_remote_wakeup
 * Description     : Remote wake up
 * Argument        : uint8_t module_number :
 * Return          : UX_SUCCESS / UX_ERROR
 **********************************************************************************************************************/
uint32_t usb_peri_usbx_remote_wakeup (uint8_t module_number)
{
    uint16_t buf;
    buf  = hw_usb_read_intsts();
    buf &= USB_DVSQ;
    if (USB_DS_SPD_CNFG == buf)
    {
        _ux_utility_delay_ms(5U);
        hw_usb_pset_wkup();

        return (uint32_t) UX_SUCCESS;
    }

    return (uint32_t) UX_ERROR;
}

  #if defined(USB_CFG_PMSC_USE)

/******************************************************************************
 * Function Name   : usb_peri_usbx_media_read
 * Description     : Wrapper function for media read
 * Argument        : VOID   *storage        : Pointer to VOID area
 *                 : ULONG  lun             : Logical Unit Number
 *                 : UCHAR  *data_pointer   : Pointer to area to store read data
 *                 : ULONG  number_blocks   : Read data size
 *                 : ULONG  lba             : logical block address
 *                 : ULNG   *media_status   : Pointer to area to store media status
 * Return          : UX_SUCCESS / UX_ERROR
 ******************************************************************************/
static UINT usb_peri_usbx_media_read (VOID  * storage,
                                      ULONG   lun,
                                      UCHAR * data_pointer,
                                      ULONG   number_blocks,
                                      ULONG   lba,
                                      ULONG * media_status)
{
    usb_err_t               err_code;
    rm_block_media_status_t status;
    uint32_t                timeout = UINT32_MAX;
    rm_block_media_status_t status_wait;
    uint32_t                timeout_wait = UINT32_MAX;

    err_code = gp_block_media_instance->p_api->statusGet(gp_block_media_instance->p_ctrl, &status);
    if (USB_SUCCESS != err_code)
    {
        return UX_ERROR;
    }
    if ((status.initialized == true) && (status.busy == false) && (status.media_inserted == true))
    {
        err_code = gp_block_media_instance->p_api->read(gp_block_media_instance->p_ctrl,
                                                        (uint8_t * const) data_pointer,
                                                        (uint32_t const) lba,
                                                        (uint32_t const) number_blocks);
        if (err_code == USB_SUCCESS)
        {
            while (timeout > 0)
            {
                timeout--;
                if (g_blockmedia_complete_event == true)
                {
                    break;
                }

