TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
                if (g_blockmedia_poll_status_events == true)
                {
                    memset(&status_wait, 0U, sizeof(status_wait));
                    do
                    {
                        timeout_wait--;
                        if (0U == timeout_wait)
                        {
                            break;
                        }

                        gp_block_media_instance->p_api->statusGet(gp_block_media_instance->p_ctrl, &status_wait);
                    } while (status.busy);

                    g_blockmedia_complete_event     = false;
                    g_blockmedia_poll_status_events = false;
                    break;
                }
            }

            g_blockmedia_complete_event = false;
        }
    }
    else
    {
        g_status_busy = true;
    }

    if (err_code == USB_SUCCESS)
    {
        return UX_SUCCESS;
    }
    else
    {
        return UX_ERROR;
    }
}                                      /* End of function usb_peri_usbx_media_read() */

/******************************************************************************
 * Function Name   : usb_peri_usbx_media_write
 * Description     : Wrapper function for media write
 * Argument        : VOID   *storage        : Pointer to VOID area
 *                 : ULONG  lun             : Logical Unit Number
 *                 : UCHAR  *data_pointer   : Pointer to the area write data is stored
 *                 : ULONG  number_blocks   : Write data size
 *                 : ULONG  lba             : logical block address
 *                 : ULNG   *media_status   : Pointer to area to store media status
 * Return          : UX_SUCCESS / UX_ERROR
 ******************************************************************************/
static UINT usb_peri_usbx_media_write (VOID  * storage,
                                       ULONG   lun,
                                       UCHAR * data_pointer,
                                       ULONG   number_blocks,
                                       ULONG   lba,
                                       ULONG * media_status)
{
    usb_err_t               err_code;
    rm_block_media_status_t status;
    uint32_t                timeout = UINT32_MAX;
    rm_block_media_status_t status_wait;
    uint32_t                timeout_wait = UINT32_MAX;

    err_code = gp_block_media_instance->p_api->statusGet(gp_block_media_instance->p_ctrl, &status);
    if (USB_SUCCESS != err_code)
    {
        return UX_ERROR;
    }
    if ((status.initialized == true) && (status.busy == false) && (status.media_inserted == true))
    {
        err_code =
            gp_block_media_instance->p_api->write(gp_block_media_instance->p_ctrl, (uint8_t * const) data_pointer,
                                                  (uint32_t const) lba, (uint32_t const) number_blocks);
        if (err_code == USB_SUCCESS)
        {
            while (timeout > 0)
            {
                timeout--;
                if (g_blockmedia_complete_event == true)
                {
                    break;
                }

                if (g_blockmedia_poll_status_events == true)
                {
                    memset(&status_wait, 0U, sizeof(status_wait));
                    do
                    {
                        timeout_wait--;
                        if (0U == timeout_wait)
                        {
                            break;
                        }

                        gp_block_media_instance->p_api->statusGet(gp_block_media_instance->p_ctrl, &status_wait);
                    } while (status.busy);

                    g_blockmedia_complete_event     = false;
                    g_blockmedia_poll_status_events = false;
                    break;
                }
            }

            g_blockmedia_complete_event = false;
        }
    }
    else
    {
        g_status_busy = true;
    }

    if (err_code == USB_SUCCESS)
    {
        return UX_SUCCESS;
    }
    else
    {
        return UX_ERROR;
    }
}                                      /* End of function usb_peri_usbx_media_write() */

/******************************************************************************
 * Function Name   : usb_peri_usbx_media_status
 * Description     : Block media status check function
 * Argument        : VOID   *storage        : Pointer to VOID area
 *                 : ULONG  lun             : Logical Unit Number
 *                 : ULONG  media_id        : Media ID number
 *                 : ULNG   *media_status   : Pointer to area to store media status
 * Return          : UX_SUCCESS
 ******************************************************************************/
static UINT usb_peri_usbx_media_status (VOID * storage, ULONG lun, ULONG media_id, ULONG * media_status)
{
    (void) storage;
    (void) lun;
    (void) media_id;
    (void) media_status;

    return UX_SUCCESS;
}                                      /* End of function usb_peri_usbx_media_status() */

/******************************************************************************
 * Function Name   : usb_peri_usbx_pmsc_media_initialize
 * Description     : Block media initialize processing
 * Argument        : void const * p_context :
 * Return          : USB_SUCCESS / USB_ERR_NG
 ******************************************************************************/
usb_err_t usb_peri_usbx_pmsc_media_initialize (void const * p_context)
{
    usb_err_t               err_code = USB_ERR_NG;
    rm_block_media_status_t status;
    rm_block_media_info_t   info;

    if (USB_NULL != p_context)
    {
        gp_block_media_instance = (rm_block_media_instance_t *) p_context;
        err_code                = gp_block_media_instance->p_api->open(gp_block_media_instance->p_ctrl,
                                                                       gp_block_media_instance->p_cfg);
        if (USB_SUCCESS != err_code)
        {
            return USB_ERR_NG;
        }
        err_code = gp_block_media_instance->p_api->mediaInit(gp_block_media_instance->p_ctrl);
        if (USB_SUCCESS == err_code)
        {
            err_code = gp_block_media_instance->p_api->statusGet(gp_block_media_instance->p_ctrl, &status);
            if (USB_SUCCESS == err_code)
            {
                if ((status.initialized == true) && (status.busy == false) && (status.media_inserted == true))
                {
                    err_code = gp_block_media_instance->p_api->infoGet(gp_block_media_instance->p_ctrl, &info);
                    if (USB_SUCCESS == err_code)
                    {
                        g_media_total_sector      = info.num_sectors;
                        g_media_sector_size_bytes = info.sector_size_bytes;
                        g_media_write_protected   = info.write_protected;
                    }
                    else
                    {
                        gp_block_media_instance->p_api->close(gp_block_media_instance->p_ctrl);
                        err_code = USB_ERR_NG;
                    }
                }
                else
                {
                    gp_block_media_instance->p_api->close(gp_block_media_instance->p_ctrl);
                    err_code = USB_ERR_NG;
                }
            }
            else
            {
                gp_block_media_instance->p_api->close(gp_block_media_instance->p_ctrl);
                err_code = USB_ERR_NG;
            }
        }
        else
        {
            gp_block_media_instance->p_api->close(gp_block_media_instance->p_ctrl);
            err_code = USB_ERR_NG;
        }
    }

    return err_code;
}                                      /* End of function usb_peri_usbx_pmsc_media_initialize() */

