TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
/******************************************************************************
 * Function Name   : usb_peri_usbx_media_close
 * Description     : Block media close processing
 * Argument        : void const * p_context :
 * Return          : USB_SUCCESS
 ******************************************************************************/
usb_err_t usb_peri_usbx_media_close (void)
{
    usb_err_t err_code;

    err_code = gp_block_media_instance->p_api->close(gp_block_media_instance->p_ctrl);

    return err_code;
}                                      /* End of function usb_peri_usbx_media_close() */

/******************************************************************************
 * Function Name   : usb_peri_usbx_pmsc_storage_init
 * Description     : Initialization processing for USBX PMSC
 * Argument        : None
 * Return          : None
 ******************************************************************************/
static void usb_peri_usbx_pmsc_storage_init (void)
{
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_number_lun = 1;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_lun[0].ux_slave_class_storage_media_last_lba =
        (g_media_total_sector - 1);
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_lun[0].ux_slave_class_storage_media_block_length =
        g_media_sector_size_bytes;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_lun[0].ux_slave_class_storage_media_type =
        UX_SLAVE_CLASS_STORAGE_MEDIA_FAT_DISK;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_lun[0].ux_slave_class_storage_media_removable_flag =
        USB_PERI_USBX_REMOVABLE_MEDIA;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_lun[0].ux_slave_class_storage_media_read_only_flag =
        g_media_write_protected;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_lun[0].ux_slave_class_storage_media_read =
        usb_peri_usbx_media_read;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_lun[0].ux_slave_class_storage_media_write =
        usb_peri_usbx_media_write;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_lun[0].ux_slave_class_storage_media_flush =
        UX_NULL;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_lun[0].ux_slave_class_storage_media_status =
        usb_peri_usbx_media_status;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_lun[0].ux_slave_class_storage_media_notification =
        UX_NULL;

    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_instance_activate        = UX_NULL;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_instance_deactivate      = UX_NULL;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_vendor_id      = (UCHAR *) USB_CFG_PMSC_VENDOR;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_product_id     = (UCHAR *) USB_CFG_PMSC_PRODUCT;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_product_rev    = (UCHAR *) USB_CFG_PMSC_REVISION;
    g_usb_peri_usbx_pmsc_parameter.ux_slave_class_storage_parameter_product_serial = (uint8_t *) "NULL";

    ux_device_stack_class_register(_ux_system_slave_class_storage_name,
                                   ux_device_class_storage_entry,
                                   1,
                                   0x00,
                                   (void *) &g_usb_peri_usbx_pmsc_parameter);
}                                      /* End of function usb_peri_usbx_pmsc_storage_init() */

/******************************************************************************
 * Function Name   : usb_peri_usbx_pmsc_storage_uninit
 * Description     : Uninitialization processing for USBX PMSC
 * Argument        : None
 * Return          : None
 ******************************************************************************/
static void usb_peri_usbx_pmsc_storage_uninit (void)
{
    ux_device_stack_class_unregister(_ux_system_slave_class_storage_name, ux_device_class_storage_entry);
}                                      /* End of function usb_peri_usbx_pmsc_storage_uninit() */

/******************************************************************************
 * Function Name   : r_usb_pmsc_block_media_event_callback
 * Description     : Callback for USBX PMSC
 * Argument        : p_args : Pointer to rm_block_media_callback_args_t structure
 * Return          : None
 ******************************************************************************/
void r_usb_pmsc_block_media_event_callback (rm_block_media_callback_args_t * p_args)
{
    if (RM_BLOCK_MEDIA_EVENT_MEDIA_INSERTED == p_args->event)
    {
        g_card_inserted = true;
    }

    if (RM_BLOCK_MEDIA_EVENT_MEDIA_REMOVED == p_args->event)
    {
        g_card_inserted = false;
    }

    if (RM_BLOCK_MEDIA_EVENT_OPERATION_COMPLETE == p_args->event)
    {
        g_blockmedia_complete_event = true;
    }

    if (RM_BLOCK_MEDIA_EVENT_POLL_STATUS & p_args->event)
    {
        g_blockmedia_poll_status_events = true;
    }
}                                      /* End of function r_usb_pmsc_block_media_event_callback() */

  #endif                               /* defined(USB_CFG_PMSC_USE) */

 #endif                                /* ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI) */

 #if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)

/******************************************************************************
 * Function Name   : usb_host_usbx_initialize
 * Description     : Initialization processing
 * Argument        : UX_HCD * hcd : Pointer to UX_HCD structure
 * Return          : USB_SUCCESS
 ******************************************************************************/
UINT usb_host_usbx_initialize (UX_HCD * hcd)
{
    UINT status;

    /* Initialize USB peripheral except interrupts. */
    status = usb_host_usbx_initialize_common(hcd);
    if (USB_SUCCESS == status)
    {
        /* Enable USB interrupts to activate USB port. */
        usb_host_usbx_initialize_common_complete(hcd);
    }
    else
    {
    	status = UX_ERROR;
    }

