TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
    return status;
}                                      /* End of function usb_host_usbx_initialize() */

/******************************************************************************
 * Function Name   : usb_host_usbx_initialize_common
 * Description     : Initialization processing
 * Argument        : UX_HCD * hcd : Pointer to UX_HCD structure
 * Return          : USB_SUCCESS
 ******************************************************************************/
static UINT usb_host_usbx_initialize_common (UX_HCD * hcd)
{
    /* Set the state of the controller to HALTED first.  */
    hcd->ux_hcd_status = (uint32_t) UX_HCD_STATUS_HALTED;

    hcd->ux_hcd_available_bandwidth = UX_PORT_HC_AVAILABLE_BANDWIDTH;

    /* Initialize the function collector for this HCD.  */
    hcd->ux_hcd_entry_function = usb_host_usbx_to_basic;

    /* Get the number of ports on the controller. The number of ports needs to be reflected both
     * for the generic HCD container and the local Synergy container.  */
    hcd->ux_hcd_nb_root_hubs = 1U;

  #if defined(USB_CFG_OTG_USE)
    if (R_USB_HS0_BASE == hcd->ux_hcd_io)
    {
        _ux_system_otg->ux_system_otg_function = usb2_otg_hnp_swap;
    }
    else
    {
        _ux_system_otg->ux_system_otg_function = usb_otg_hnp_swap;
    }
  #endif                               /* defined(USB_CFG_OTG_USE) */

    /* Return successful completion.  */
    return UX_SUCCESS;
}                                      /* End of function usb_host_usbx_initialize_common() */

/******************************************************************************
 * Function Name   : usb_host_usbx_initialize_common_complete
 * Description     : Initialization processing
 * Argument        : UX_HCD * hcd : Pointer to UX_HCD structure
 * Return          : None
 ******************************************************************************/
static void usb_host_usbx_initialize_common_complete (UX_HCD * hcd)
{
    /* Set the controller to operational mode.  */
    hcd->ux_hcd_status = (uint32_t) UX_HCD_STATUS_OPERATIONAL;
}                                      /* End of function usb_host_usbx_initialize_common_complete() */

/******************************************************************************
 * Function Name   : usb_host_usbx_uninitialize
 * Description     : Uninitialization processing
 * Argument        : hcd_io: USB module start address
 * Return          : UX_SUCCESS
 ******************************************************************************/
usb_err_t usb_host_usbx_uninitialize (uint32_t hcd_io)
{
    UX_HCD * hcd;

    (void) hcd_io;

    hcd = _ux_system_host->ux_system_host_hcd_array;

    hcd->ux_hcd_status = (uint32_t) UX_UNUSED;

    /* Set the hcd controller hardware to unknown.  */
    hcd->ux_hcd_controller_hardware = UX_NULL;

    /* Reset HCD controller type. */
    hcd->ux_hcd_controller_type = 0U;

    /* Initialize the max bandwidth for periodic endpoints to zero. */
    hcd->ux_hcd_available_bandwidth = 0UL;

    /* Initialize the function collector for this HCD to NULL.  */
    hcd->ux_hcd_entry_function = UX_NULL;

    /* Set the number of ports on the controller to zero.  */
    hcd->ux_hcd_nb_root_hubs = 0U;

    return USB_SUCCESS;
}                                      /* End of function usb_host_usbx_uninitialize() */

/******************************************************************************
 * Function Name    : usb_host_usbx_configured
 * Description      : Callback function for CDC device configuered
 * Argument         : usb_utr_t    *p_utr    : Pointer to usb_utr_t structure.
 *                  : uint16_t     devadr  : Device Adrress
 *                  : uint16_t     data2   : Not used
 * Return value    : none
 ******************************************************************************/
static void usb_host_usbx_configured (usb_utr_t * p_utr, uint16_t devadr, uint16_t data2)
{
    (void) data2;
    (void) p_utr;
    (void) devadr;
}                                      /* End of function usb_host_usbx_configured() */

/******************************************************************************
 * Function Name    : usb_host_usbx_configured
 * Description      : USB pipe registration processing
 * Argument         : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
 *                  : uint16_t     devadr  : Device Adrress
 * Return value    : none
 ******************************************************************************/
static void usb_host_usbx_set_pipe_registration (usb_utr_t * ptr, uint16_t dev_addr)
{
    uint8_t pipe_no;

    /* Device address check */
    if (0 != dev_addr)
    {
        /* Search use pipe block */
        /* WAIT_LOOP */
        for (pipe_no = USB_MIN_PIPE_NO; pipe_no < (USB_MAX_PIPE_NO + 1); pipe_no++)
        {
            /* Check use block */
            if (USB_TRUE == g_usb_pipe_table[ptr->ip][pipe_no].use_flag)
            {
                /* Check USB Device address */
                if ((uint16_t) (dev_addr << USB_DEVADDRBIT) ==
                    (uint16_t) (g_usb_pipe_table[ptr->ip][pipe_no].pipe_maxp & USB_DEVSEL))
                {
                    usb_hstd_set_pipe_reg(ptr, pipe_no);
                }
            }
        }
    }
    else
    {
        /* Error */
        USB_PRINTF1("SmplOpen adr error %x\n", dev_addr);
    }
}                                      /* End of function usb_host_usbx_set_pipe_registration() */

/******************************************************************************
 * Function Name   : usb_hcdc_detach
 * Description     : Callback function for USB device detach
 * Argument        : usb_utr_t    *p_utr  : Pointer to usb_utr_t structure.
 *                 : uint16_t     devadr  : Device Adrress
 *                 : uint16_t     data2   : Not used
 * Return value    : none
 ******************************************************************************/
static void usb_host_usbx_detach (usb_utr_t * p_utr, uint16_t devadr, uint16_t data2)
{
    UX_HCD * hcd;

    (void) data2;
    hcd = _ux_system_host->ux_system_host_hcd_array;

