TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
    usb_hstd_clr_pipe_table(p_utr->ip, devadr);
    _ux_host_stack_rh_device_extraction(hcd, 0);
}                                      /* End of function usb_host_usbx_detach() */

/******************************************************************************
 * Function Name : usb_hcdc_init
 * Description   : Initialize of Host USB driver.
 * Arguments     : usb_utr_t    *p_utr  : Pointer to usb_utr_t structure.
 *               : uint16_t     data1   : not use
 *               : uint16_t     data2   : not use
 * Return value    : none
 ******************************************************************************/
static void usb_host_usbx_init (usb_utr_t * p_utr, uint16_t data1, uint16_t data2)
{
    (void) p_utr;
    (void) data1;
    (void) data2;
}                                      /* End of function usb_host_usbx_init() */

/******************************************************************************
 * Function Name   : usb_host_usbx_registration
 * Description     : registration of Communications Devices class Driver
 * Argument        : usb_utr_t    *p_utr    : Pointer to usb_utr_t structure.
 * Return          : none
 ******************************************************************************/
void usb_host_usbx_registration (usb_utr_t * p_utr)
{
    usb_hcdreg_t driver;
  #if USB_CFG_HUB == USB_CFG_ENABLE
    uint8_t i;
  #endif                               /* USB_CFG_HUB == USB_CFG_ENABLE */

    /* Driver registration */
  #if defined(USB_CFG_HCDC_USE)
   #if USB_CFG_HCDC_IFCLS == USB_CFG_CDC
    driver.ifclass = (uint16_t) USB_IFCLS_CDC; /* Interface class : CDC Communications Interface */
   #else                                       /* USB_CFG_HCDC_IFCLS == USB_CFG_CDC */
    driver.ifclass = (uint16_t) USB_IFCLS_VEN; /* CDC Communications Interface */
   #endif /* USB_CFG_HCDC_IFCLS == USB_CFG_CDC */
  #endif /* defined(USB_CFG_HCDC_USE) */

  #if defined(USB_CFG_HHID_USE)
    driver.ifclass = (uint16_t) USB_IFCLS_HID; /* Interface class : HID */
  #endif /* defined(USB_CFG_HHID_USE) */

  #if defined(USB_CFG_HMSC_USE)
    driver.ifclass = (uint16_t) USB_IFCLS_MAS; /* Interface class : HID */
  #endif /* defined(USB_CFG_HMSC_USE) */

  #if defined(USB_CFG_HPRN_USE)
    driver.ifclass = (uint16_t) USB_IFCLS_PRN; /* Interface class : Printer */
  #endif /* defined(USB_CFG_HPRN_USE) */

  #if USB_CFG_COMPLIANCE == USB_CFG_ENABLE
    driver.p_tpl = (uint16_t *) USB_CFG_TPL_TABLE;
  #else                                                              /* #if USB_CFG_COMPLIANCE == USB_CFG_ENABLE */
    driver.p_tpl = (uint16_t *) &g_usb_host_usbx_device_tpl;         /* Target peripheral list */
  #endif /* #if USB_CFG_COMPLIANCE == USB_CFG_ENABLE */
    driver.classinit  = (usb_cb_t) &usb_host_usbx_init;              /* Driver init */
    driver.classcheck = (usb_cb_check_t) &usb_host_usbx_class_check; /* Driver check */
    driver.devconfig  = (usb_cb_t) &usb_host_usbx_configured;        /* Device configuered */
    driver.devdetach  = (usb_cb_t) &usb_host_usbx_detach;            /* Device detach */

    driver.devsuspend = (usb_cb_t) &usb_hstd_dummy_function;         /* Device suspend */
    driver.devresume  = (usb_cb_t) &usb_hstd_dummy_function;         /* Device resume */

  #if USB_CFG_HUB == USB_CFG_ENABLE

    /* WAIT_LOOP */
    for (i = 0; i < USB_MAX_CONNECT_DEVICE_NUM; i++)  /* Loop support CDC device count */
    {
        usb_hstd_driver_registration(p_utr, &driver); /* Host CDC class driver registration. */
    }

   #if (BSP_CFG_RTOS_USED == 0)
    usb_cstd_set_task_pri(USB_HUB_TSK, USB_PRI_3);    /* Hub Task Priority set */
   #endif /* (BSP_CFG_RTOS_USED == 0) */
    usb_hhub_registration(p_utr, USB_NULL);           /* Hub registration. */
  #else                                               /* USB_CFG_HUB == USB_CFG_ENABLE */
    usb_hstd_driver_registration(p_utr, &driver);     /* Host CDC class driver registration. */
  #endif /* USB_CFG_HUB == USB_CFG_ENABLE */
}                                                     /* End of function usb_host_usbx_registration() */

/******************************************************************************
 * Function Name    : usb_host_usbx_class_check
 * Description      : class check.
 * Arguments        : usb_utr_t    *p_utr   : Pointer to usb_utr_t structure.
 *                  : uint16_t     **table  : Pointer to data table.
 * Return           : none
 ******************************************************************************/
void usb_host_usbx_class_check (usb_utr_t * p_utr, uint16_t ** table)
{
  #if defined(USB_CFG_HCDC_USE) || defined(USB_CFG_HHID_USE) || defined(USB_CFG_HMSC_USE) || defined(USB_CFG_HPRN_USE)
    uint16_t  speed;
    uint16_t  length;
    uint16_t  offset;
    uint16_t  usb_class;
    uint8_t * p_config;
   #if !defined(USB_CFG_HMSC_USE)
    uint8_t              pipe_no;
    usb_pipe_table_reg_t ep_tbl;
   #endif                              /* #if !defined(USB_CFG_HMSC_USE) */

   #if defined(USB_CFG_HHID_USE)
    uint8_t num_set_pipe   = 0;
    uint8_t set_pipe_no[2] = {0, 0};
   #endif                              /* defined(USB_CFG_HHID_USE) */

    speed    = *table[6];
    p_config = (uint8_t *) table[1];
    length   = (uint16_t) (*(p_config + 3) << 8);
    length   = (uint16_t) (length + *(p_config + 2));

   #if defined(USB_CFG_HCDC_USE)
    usb_class = USB_HCDC;
   #endif

   #if defined(USB_CFG_HHID_USE)
    usb_class = USB_HHID;
   #endif

   #if defined(USB_CFG_HMSC_USE)
    usb_class = USB_HMSC;
   #endif

   #if defined(USB_CFG_HPRN_USE)
    usb_class = USB_HPRN;
   #endif

    offset = 0;
    while (offset < length)
    {
        if (USB_DT_ENDPOINT == *(p_config + offset + USB_EP_B_DESCRIPTORTYPE))
        {
   #if defined(USB_CFG_HMSC_USE)
            if (USB_EP_IN == (*(p_config + offset + USB_EP_B_ENDPOINTADDRESS) & USB_EP_DIRMASK))
            {
                g_usb_hmsc_in_pipe[p_utr->ip][0] = usb_hstd_make_pipe_reg_info(p_utr->ip,
                                                                               USB_DEVICEADDR,
                                                                               usb_class,
                                                                               speed,
                                                                               (p_config + offset),
                                                                               &g_usb_hmsc_pipe_table[0][
                                                                                   USB_PIPE_DIR_IN]);

                g_usb_hmsc_in_pipectr[p_utr->ip][0] = 0;
            }
            else
            {
                g_usb_hmsc_out_pipe[p_utr->ip][0] = usb_hstd_make_pipe_reg_info(p_utr->ip,
                                                                                USB_DEVICEADDR,
                                                                                usb_class,
                                                                                speed,
                                                                                (p_config + offset),
                                                                                &g_usb_hmsc_pipe_table[0][
                                                                                    USB_PIPE_DIR_OUT]);

                g_usb_hmsc_out_pipectr[p_utr->ip][0] = 0;
            }

   #else                               /* defined(USB_CFG_HMSC_USE) */
            pipe_no = usb_hstd_make_pipe_reg_info(p_utr->ip,
                                                  USB_DEVICEADDR,
                                                  usb_class,
                                                  speed,
                                                  (p_config + offset),
                                                  &ep_tbl);
            if (USB_NULL != pipe_no)
            {
    #if defined(USB_CFG_HHID_USE)
                if ((pipe_no != set_pipe_no[0]) && (pipe_no != set_pipe_no[1]) && (num_set_pipe < 2))
                {
                    set_pipe_no[num_set_pipe] = pipe_no;
                    num_set_pipe++;
                    usb_hstd_set_pipe_info(p_utr->ip, pipe_no, &ep_tbl);
                }

    #else                              /* defined(USB_CFG_HHID_USE) */
                usb_hstd_set_pipe_info(p_utr->ip, pipe_no, &ep_tbl);
    #endif /* defined(USB_CFG_HHID_USE) */
            }
            else
            {
                while (1)
                {
                    ;
                }
            }
   #endif                              /* defined(USB_CFG_HMSC_USE) */
        }

        offset = (uint16_t) (offset + (*(p_config + offset)));
    }
  #endif                               /* defined(USB_CFG_HCDC_USE) | defined(USB_CFG_HHID_USE) */

    *table[3] = USB_OK;                /* Set class check done  */
}                                      /* End of function usb_host_usbx_class_check() */

