TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
/******************************************************************************
 * Function Name    : usb_host_usbx_get_speed
 * Description      : Get the connected USB device speed.
 * Arguments        : UX_HCD    *hcd    : Pointer to UX_HCD structure.
 * Return           : USB speed valule
 ******************************************************************************/
static uint32_t usb_host_usbx_get_speed (UX_HCD * hcd)
{
    usb_utr_t utr;
    uint16_t  connect_inf;
    uint32_t  speed;

    if (R_USB_HS0_BASE == hcd->ux_hcd_io)
    {
        utr.ip = USB_IP1;
    }
    else
    {
        utr.ip = USB_IP0;
    }

    utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);

    connect_inf = usb_cstd_port_speed(&utr);

    if (USB_HSCONNECT == connect_inf)
    {
        speed = (uint32_t) UX_HIGH_SPEED_DEVICE;
    }
    else if (USB_FSCONNECT == connect_inf)
    {
        speed = (uint32_t) UX_FULL_SPEED_DEVICE;
    }
    else
    {
        speed = (uint32_t) UX_LOW_SPEED_DEVICE;
    }

    return speed;
}                                      /* End of function usb_host_usbx_get_speed() */

/******************************************************************************
 * Function Name    : usb_hstd_attach_init_usbx
 * Description      : USBX initialization when attaching USB device
 * Arguments        : None
 * Return           : None
 ******************************************************************************/
void usb_host_usbx_attach_init (uint8_t module_number)
{
    UX_HCD      * hcd;
    UX_DEVICE   * device;
    UX_ENDPOINT * control_endpoint;

    hcd    = _ux_system_host->ux_system_host_hcd_array;
    device = _ux_host_stack_new_device_get();

    device->ux_device_handle        = (uint32_t) device;
    device->ux_device_state         = UX_DEVICE_ATTACHED;
    device->ux_device_parent        = UX_NULL;
    device->ux_device_hcd           = hcd;
    device->ux_device_speed         = usb_host_usbx_get_speed(hcd);
    device->ux_device_port_location = 0;
    device->ux_device_max_power     = UX_PORT_MAX_SELF_POWER;
    device->ux_device_address       = USB_DEVICEADDR;

    control_endpoint                            = &device->ux_device_control_endpoint;
    control_endpoint->ux_endpoint               = (uint32_t) control_endpoint;
    control_endpoint->ux_endpoint_next_endpoint = UX_NULL;
    control_endpoint->ux_endpoint_interface     = UX_NULL;
    control_endpoint->ux_endpoint_device        = device;
    control_endpoint->ux_endpoint_transfer_request.ux_transfer_request_endpoint = control_endpoint;
    control_endpoint->ux_endpoint_descriptor.wMaxPacketSize = UX_DEFAULT_MPS;

    g_p_usbx_device[module_number] = device;

    _ux_utility_semaphore_create(&device->ux_device_protection_semaphore, "ux_host_endpoint0_semaphore", 1);
    tx_semaphore_create(&g_usb_host_usbx_sem[module_number][USB_PIPE0], "USB_USBX_SEM_HOST", 0);
}                                      /* End of function usb_host_usbx_attach_init() */

/******************************************************************************
 * Function Name   : usb_host_usbx_endpoint_to_pipe
 * Description     : Get USB pipe number based on endpoint.
 * Argument        : uint8_t    module_number   : USB module number
 *                 : uint8_t    ep_number       : Endpoint number
 * Return          : Pipe Number
 ******************************************************************************/
static uint8_t usb_host_usbx_endpoint_to_pipe (uint8_t module_number, uint8_t ep_number)
{
    uint16_t endpoint;
    uint8_t  pipe_no;

    for (pipe_no = USB_MIN_PIPE_NO; pipe_no < (USB_MAX_PIPE_NO + 1); pipe_no++)
    {
        if (USB_TRUE == g_usb_pipe_table[module_number][pipe_no].use_flag)
        {
            endpoint = g_usb_pipe_table[module_number][pipe_no].pipe_cfg & USB_EPNUMFIELD;
            if ((uint8_t) endpoint == ep_number)
            {
                break;
            }
        }
    }

    return pipe_no;
}                                      /* End of function usb_host_usbx_endpoint_to_pipe() */

/******************************************************************************
 * Function Name   : usb_host_usbx_set_configuration_cb
 * Description     : CallBack Function
 * Argument        : usb_utr_t *p_utr   : Pointer to usb_utr_t structure
 * Return          : none
 ******************************************************************************/
static void usb_host_usbx_set_configuration_cb (usb_utr_t * p_utr, uint16_t data1, uint16_t data2)
{
    (void) data1;
    (void) data2;
    uint8_t pipe;

    pipe = (uint8_t) p_utr->keyword;

    g_usb_hstd_mgr_mode[p_utr->ip] = USB_CONFIGURED;
    tx_semaphore_put(&g_usb_host_usbx_sem[p_utr->ip][pipe]);
    usb_host_usbx_set_pipe_registration(p_utr, g_usb_hstd_device_addr[p_utr->ip]); /* Host Pipe registration */
    usb_hstd_mgr_snd_mbx(p_utr, (uint16_t) USB_MSG_MGR_SUBMITRESULT, p_utr->keyword, p_utr->status);
} /* End of function usb_pstd_transfer_complete_cb() */

/******************************************************************************
 * Function Name   : usb_host_usbx_class_request_cb
 * Description     : CallBack Function
 * Argument        : usb_utr_t *p_utr   : Pointer to usb_utr_t structure
 * Return          : none
 ******************************************************************************/
static void usb_host_usbx_class_request_cb (usb_utr_t * p_utr, uint16_t data1, uint16_t data2)
{
    (void) data1;
    (void) data2;
    uint8_t pipe;

    pipe = (uint8_t) p_utr->keyword;

  #if (defined(USB_CFG_HHID_USE) | defined(USB_CFG_HPRN_USE) | defined(USB_CFG_HCDC_USE))
    *g_p_usb_host_actural_length[p_utr->ip][0] = p_utr->read_req_len - p_utr->tranlen;
  #endif                               /* (defined(USB_CFG_HHID_USE) | defined(USB_CFG_HPRN_USE) | defined(USB_CFG_HCDC_USE) */

    tx_semaphore_put(&g_usb_host_usbx_sem[p_utr->ip][pipe]);
}                                      /* End of function usb_pstd_transfer_complete_cb() */

/******************************************************************************
 * Function Name   : usb_hstd_transfer_complete_cb
 * Description     : CallBack Function
 * Argument        : usb_utr_t *p_utr   : Pointer to usb_utr_t structure
 * Return          : none
 ******************************************************************************/
static void usb_host_usbx_transfer_complete_cb (usb_utr_t * p_utr, uint16_t data1, uint16_t data2)
{
    (void) data1;
    (void) data2;
    uint8_t       pipe;
    UX_TRANSFER * transfer_request;
    uint16_t      pipe_reg;
  #if defined(USB_CFG_HCDC_USE)
    UX_HOST_CLASS_CDC_ACM * cdc_acm = NULL;
    ULONG class;
  #endif                               /* defined(USB_CFG_HCDC_USE) */

