TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
  #if defined(USB_CFG_OTG_USE)
    UINT           status;
    CHAR         * p_sem_name;
    ULONG          current_value;
    TX_THREAD    * p_suspend_thread;
    ULONG          suspend_count;
    TX_SEMAPHORE * p_next_sem;
  #endif                               /* defined(USB_CFG_OTG_USE) */

  #if defined(USB_CFG_HMSC_USE)
   #if (USB_CFG_DMA == USB_CFG_ENABLE)
    uint32_t  counter;
    uint8_t * p_read;
    uint8_t * p_write;
   #endif                              /* (USB_CFG_DMA == USB_CFG_ENABLE) */
  #endif                               /* defined(USB_CFG_HMSC_USE) */

    pipe             = (uint8_t) p_utr->keyword;
    transfer_request = g_p_usb_host_usbx_transfer_request[p_utr->ip][pipe];

  #if defined(USB_CFG_HCDC_USE)
    class =
        transfer_request->ux_transfer_request_endpoint->ux_endpoint_interface->ux_interface_descriptor.bInterfaceClass;

    if (USB_IFCLS_CDCD == class)
    {
        /* Get the class instance for this transfer request.  */
        cdc_acm = (UX_HOST_CLASS_CDC_ACM *) transfer_request->ux_transfer_request_class_instance;
    }
  #endif                               /* defined(USB_CFG_HCDC_USE) */

    if (USB_PIPE0 == pipe)
    {
        tx_semaphore_put(&g_usb_host_usbx_sem[p_utr->ip][pipe]);
    }

    hw_usb_write_pipesel(p_utr, pipe);
    pipe_reg = hw_usb_read_pipecfg(p_utr);

    if (0 != (pipe_reg & USB_DIRFIELD))
    {
        /* OUT */
        *g_p_usb_host_actural_length[p_utr->ip][pipe] = p_utr->read_req_len;
    }
    else
    {
        /* IN */
        *g_p_usb_host_actural_length[p_utr->ip][pipe] = p_utr->read_req_len - p_utr->tranlen;
    }

  #if defined(USB_CFG_HMSC_USE)
    if (USB_DATA_STALL == p_utr->status)
    {
        g_usb_hmsc_in_pipectr[p_utr->ip][0] = 0;
        transfer_request->ux_transfer_request_completion_code = UX_TRANSFER_STALLED;
    }
    else
    {
        transfer_request->ux_transfer_request_completion_code = UX_SUCCESS;

        if (0 != (pipe_reg & USB_DIRFIELD))
        {
            /* OUT */
            g_usb_hmsc_out_pipectr[p_utr->ip][0] = hw_usb_read_pipectr(p_utr, pipe);
        }
        else
        {
            /* IN */
   #if (USB_CFG_DMA == USB_CFG_ENABLE)
            if (0 != g_p_usbx_hmsc_dma_buf[USB_DEVICEADDR - 1])
            {
                p_read  = (uint8_t *) g_p_usbx_hmsc_dma_buf[USB_DEVICEADDR - 1];
                p_write = transfer_request->ux_transfer_request_data_pointer;

                for (counter = 0UL; counter != p_utr->read_req_len; counter++)
                {
                    *(p_write + counter) = *(p_read + counter);
                }

                _ux_utility_memory_free(g_p_usbx_hmsc_dma_buf[USB_DEVICEADDR - 1]);
                g_p_usbx_hmsc_dma_buf[USB_DEVICEADDR - 1] = (void *) 0;
            }
   #endif                              /* (USB_CFG_DMA == USB_CFG_ENABLE) */
            g_usb_hmsc_in_pipectr[p_utr->ip][0] = hw_usb_read_pipectr(p_utr, pipe);
        }
    }
  #endif                               /* #if defined(USB_CFG_HMSC_USE) */

  #if defined(USB_CFG_HHID_USE)
    transfer_request->ux_transfer_request_completion_code = UX_SUCCESS;
    if (UX_NULL != transfer_request->ux_transfer_request_completion_function)
    {
        transfer_request->ux_transfer_request_completion_function(transfer_request);
    }
  #endif                               /* defined(USB_CFG_HHID_USE) */

  #if defined(USB_CFG_HPRN_USE)
    transfer_request->ux_transfer_request_completion_code = UX_SUCCESS;
    if (UX_NULL != transfer_request->ux_transfer_request_completion_function)
    {
        transfer_request->ux_transfer_request_completion_function(transfer_request);
    }
  #endif                               /* defined(USB_CFG_HPRN_USE) */

  #if defined(USB_CFG_HCDC_USE)

    /* Check for the CDC-Data Class.*/
    /* Check if there is a transfer request completion callback function is registered.*/
    /* Check the error condition */
    if ((USB_IFCLS_CDCD == cdc_acm->ux_host_class_cdc_acm_interface->ux_interface_descriptor.bInterfaceClass) &&
        (NULL != transfer_request->ux_transfer_request_completion_function) &&
        (USB_DATA_ERR != p_utr->status))
    {
        /* Set the transfer code to completed.*/
        transfer_request->ux_transfer_request_completion_code = UX_SUCCESS;

        /* Invoke the transfer completion callback function */
        transfer_request->ux_transfer_request_completion_function(transfer_request);
    }
    else
    {
        transfer_request->ux_transfer_request_completion_code = UX_SUCCESS;
        if (UX_NULL != transfer_request->ux_transfer_request_completion_function)
        {
            transfer_request->ux_transfer_request_completion_function(transfer_request);
        }
    }
  #endif                               /* defined(USB_CFG_HCDC_USE) */

  #if defined(USB_CFG_OTG_USE)
    status = tx_semaphore_info_get(&transfer_request->ux_transfer_request_semaphore,
                                   &p_sem_name,
                                   &current_value,
                                   &p_suspend_thread,
                                   &suspend_count,
                                   &p_next_sem);
    if (TX_SUCCESS == status)
    {
        if (0UL != suspend_count)
        {
            _ux_utility_semaphore_put(&transfer_request->ux_transfer_request_semaphore);
        }
    }

  #else                                /* defined(USB_CFG_OTG_USE) */
    _ux_utility_semaphore_put(&transfer_request->ux_transfer_request_semaphore);
  #endif /* defined(USB_CFG_OTG_USE) */
}                                      /* End of function usb_hstd_transfer_complete_cb() */

/******************************************************************************
 * Function Name   : usb_host_usbx_to_basic
 * Description     : Porting Layer from USBX to USB basic driver
 * Argument        : UX_HCD *dcd        :
 *                 : uint32_t function      :
 *                 : void *parameter    :
 * Return          : none
 ******************************************************************************/
static UINT usb_host_usbx_to_basic (UX_HCD * hcd, UINT function, VOID * parameter)
{
    uint32_t      status = (uint32_t) UX_SUCCESS;
    UX_ENDPOINT * endpoint;
    uint8_t       module_number;
    UX_TRANSFER * transfer_request;
    uint8_t       ep_number;
    uint32_t      size;
    uint8_t       pipe_number;
    usb_er_t      err;
  #if defined(USB_CFG_HMSC_USE)
   #if (USB_CFG_DMA == USB_CFG_ENABLE)
    uint32_t allocation_size;
    uint16_t max_packet_size;
    uint8_t  is_in_transfer = USB_NO;
   #endif                              /* #if (USB_CFG_DMA == USB_CFG_ENABLE) */
  #endif                               /* #if defined(USB_CFG_HMSC_USE) */

    if (R_USB_HS0_BASE == hcd->ux_hcd_io)
    {
        module_number = USB_IP1;
    }
    else
    {
        module_number = USB_IP0;
    }

    switch (function)
    {
        case (uint32_t) UX_HCD_TRANSFER_REQUEST:
        {
            transfer_request = (UX_TRANSFER *) parameter;
            endpoint         = (UX_ENDPOINT *) transfer_request->ux_transfer_request_endpoint;
            transfer_request->ux_transfer_request_actual_length = 0UL;

            switch ((endpoint->ux_endpoint_descriptor.bmAttributes) & (uint32_t) UX_PORT_MASK_ENDPOINT_TYPE)
            {
                case (uint32_t) UX_PORT_CONTROL_ENDPOINT:
                {
  #if defined(USB_CFG_HHID_USE)
                    if (0x0 == (transfer_request->ux_transfer_request_type & UX_REQUEST_TYPE_CLASS))
                    {
                        /* In this "case", only SetConfiguraion or the class request is processed.  */
                        if (UX_PORT_SET_CONFIGURATION == transfer_request->ux_transfer_request_function)
                        {
                            g_usb_host_usbx_request[module_number][0] =
                                USB_SET_CONFIGURATION | USB_HOST_TO_DEV | USB_STANDARD | USB_DEVICE;
                            g_usb_host_usbx_request[module_number][1] =
                                (uint16_t) transfer_request->ux_transfer_request_value; /* Configuration Number */
                            g_usb_host_usbx_request[module_number][2] = (uint16_t) 0x0000;
                            g_usb_host_usbx_request[module_number][3] = (uint16_t) 0x0000;

