TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
                            g_usb_host_usbx_req_msg[module_number].complete =
                                (usb_cb_t) &usb_host_usbx_set_configuration_cb;
                        }
                        else
                        {
                            g_usb_host_usbx_request[module_number][UX_PORT_SETUP_REQUEST_TYPE] =
                                (uint16_t) ((transfer_request->ux_transfer_request_function << 8) |
                                            (transfer_request->ux_transfer_request_type));
                            g_usb_host_usbx_request[module_number][1] =
                                (uint16_t) transfer_request->ux_transfer_request_value;
                            g_usb_host_usbx_request[module_number][2] =
                                (uint16_t) transfer_request->ux_transfer_request_index;
                            g_usb_host_usbx_request[module_number][3] =
                                (uint16_t) transfer_request->ux_transfer_request_requested_length;
                            g_usb_host_usbx_req_msg[module_number].complete =
                                (usb_cb_t) &usb_host_usbx_class_request_cb;
                        }
                    }
                    else
                    {
                        /* Class Request */
                        g_usb_host_usbx_request[module_number][UX_PORT_SETUP_REQUEST_TYPE] =
                            (uint16_t) ((transfer_request->ux_transfer_request_function << 8) |
                                        (transfer_request->ux_transfer_request_type));
                        g_usb_host_usbx_request[module_number][1] =
                            (uint16_t) transfer_request->ux_transfer_request_value;
                        g_usb_host_usbx_request[module_number][2] =
                            (uint16_t) transfer_request->ux_transfer_request_index;
                        g_usb_host_usbx_request[module_number][3] =
                            (uint16_t) transfer_request->ux_transfer_request_requested_length;
                        g_usb_host_usbx_req_msg[module_number].complete = (usb_cb_t) &usb_host_usbx_class_request_cb;
                    }

  #else                                /* #if defined(USB_CFG_HHID_USE) */
                    /* In this "case", only SetConfiguraion or the class request is processed.  */
                    if (UX_PORT_SET_CONFIGURATION == transfer_request->ux_transfer_request_function)
                    {
                        g_usb_host_usbx_request[module_number][0] =
                            USB_SET_CONFIGURATION | USB_HOST_TO_DEV | USB_STANDARD | USB_DEVICE;
                        g_usb_host_usbx_request[module_number][1] =
                            (uint16_t) transfer_request->ux_transfer_request_value; /* Configuration Number */
                        g_usb_host_usbx_request[module_number][2] = (uint16_t) 0x0000;
                        g_usb_host_usbx_request[module_number][3] = (uint16_t) 0x0000;

                        g_usb_host_usbx_req_msg[module_number].complete =
                            (usb_cb_t) &usb_host_usbx_set_configuration_cb;
                    }
                    else
                    {
                        /* Class Request */
                        g_usb_host_usbx_request[module_number][UX_PORT_SETUP_REQUEST_TYPE] =
                            (uint16_t) ((transfer_request->ux_transfer_request_function << 8) |
                                        (transfer_request->ux_transfer_request_type));
                        g_usb_host_usbx_request[module_number][1] =
                            (uint16_t) transfer_request->ux_transfer_request_value;
                        g_usb_host_usbx_request[module_number][2] =
                            (uint16_t) transfer_request->ux_transfer_request_index;
                        g_usb_host_usbx_request[module_number][3] =
                            (uint16_t) transfer_request->ux_transfer_request_requested_length;
                        g_usb_host_usbx_req_msg[module_number].complete = (usb_cb_t) &usb_host_usbx_class_request_cb;
                    }
  #endif                               /* #if defined(USB_CFG_HHID_USE) */

                    g_usb_host_usbx_request[module_number][4] = USB_DEVICEADDR;

                    g_usb_host_usbx_req_msg[module_number].keyword   = USB_PIPE0;
                    g_usb_host_usbx_req_msg[module_number].p_tranadr =
                        transfer_request->ux_transfer_request_data_pointer;
                    g_usb_host_usbx_req_msg[module_number].tranlen =
                        (uint32_t) transfer_request->ux_transfer_request_requested_length;
                    g_usb_host_usbx_req_msg[module_number].p_setup = g_usb_host_usbx_request[module_number];
                    g_usb_host_usbx_req_msg[module_number].status  = USB_DATA_NONE;
                    g_usb_host_usbx_req_msg[module_number].segment = USB_TRAN_END;
                    g_usb_host_usbx_req_msg[module_number].ip      = module_number;
                    g_usb_host_usbx_req_msg[module_number].ipp     = usb_hstd_get_usb_ip_adr(module_number);
                    g_p_usb_host_actural_length[module_number][0]  =
                        (uint32_t *) &(transfer_request->ux_transfer_request_actual_length);
                    g_usb_host_usbx_req_msg[module_number].read_req_len =
                        (uint32_t) transfer_request->ux_transfer_request_requested_length;

                    usb_hstd_transfer_start_req(&g_usb_host_usbx_req_msg[module_number]);

                    tx_semaphore_get(&g_usb_host_usbx_sem[module_number][USB_PIPE0], TX_WAIT_FOREVER);
                    break;
                }

                case (uint32_t) UX_PORT_BULK_ENDPOINT:
                case (uint32_t) UX_PORT_INTERRUPT_ENDPOINT:
                {
  #if defined(USB_CFG_HMSC_USE)
                    if (endpoint->ux_endpoint_descriptor.bEndpointAddress & USB_ENDPOINT_DIRECTION)
                    {
                        /* IN */
   #if (USB_CFG_DMA == USB_CFG_ENABLE)
                        is_in_transfer = USB_YES;
   #endif                              /* #if (USB_CFG_DMA == USB_CFG_ENABLE) */

                        usb_hstd_set_pipe_info(module_number,
                                               g_usb_hmsc_in_pipe[module_number][0],
                                               &g_usb_hmsc_pipe_table[0][USB_PIPE_DIR_IN]);
                        usb_hstd_set_pipe_reg(&g_usb_host_usbx_req_msg[module_number],
                                              g_usb_hmsc_in_pipe[module_number][0]);

                        if (USB_SQMON == (USB_SQMON & g_usb_hmsc_in_pipectr[module_number][0]))
                        {
                            hw_usb_set_sqset(&g_usb_host_usbx_req_msg[module_number],
                                             g_usb_hmsc_in_pipe[module_number][0]);
                        }
                        else
                        {
                            hw_usb_set_sqclr(&g_usb_host_usbx_req_msg[module_number],
                                             g_usb_hmsc_in_pipe[module_number][0]);
                        }
                    }
                    else
                    {
                        /* OUT */
   #if (USB_CFG_DMA == USB_CFG_ENABLE)
                        is_in_transfer = USB_NO;
   #endif                              /* #if (USB_CFG_DMA == USB_CFG_ENABLE) */

                        usb_hstd_set_pipe_info(module_number,
                                               g_usb_hmsc_out_pipe[module_number][0],
                                               &g_usb_hmsc_pipe_table[0][USB_PIPE_DIR_OUT]);
                        usb_hstd_set_pipe_reg(&g_usb_host_usbx_req_msg[module_number],
                                              g_usb_hmsc_out_pipe[module_number][0]);

                        if (USB_SQMON == (USB_SQMON & g_usb_hmsc_out_pipectr[module_number][0]))
                        {
                            hw_usb_set_sqset(&g_usb_host_usbx_req_msg[module_number],
                                             g_usb_hmsc_out_pipe[module_number][0]);
                        }
                        else
                        {
                            hw_usb_set_sqclr(&g_usb_host_usbx_req_msg[module_number],
                                             g_usb_hmsc_out_pipe[module_number][0]);
                        }
                    }
  #endif

                    size        = transfer_request->ux_transfer_request_requested_length;
                    ep_number   = endpoint->ux_endpoint_descriptor.bEndpointAddress & USB_EPNUMFIELD;
                    pipe_number = usb_host_usbx_endpoint_to_pipe(module_number, ep_number); /* Pipe Number */
                    g_usb_host_usbx_req_msg[module_number].read_req_len = size;             /* Request Data Size */
                    g_usb_host_usbx_req_msg[module_number].keyword      = pipe_number;      /* Pipe Number */
                    g_usb_host_usbx_req_msg[module_number].p_tranadr    =
                        transfer_request->ux_transfer_request_data_pointer;                 /* Data address */

  #if defined(USB_CFG_HMSC_USE)
   #if (USB_CFG_DMA == USB_CFG_ENABLE)
                    if (USB_YES == is_in_transfer)
                    {
                        // IN transfere
                        max_packet_size = (uint16_t) endpoint->ux_endpoint_descriptor.wMaxPacketSize;
                        if (0 != (size % max_packet_size))
                        {
                            allocation_size = ((size / max_packet_size) + 1) * max_packet_size;
                            g_p_usbx_hmsc_dma_buf[USB_DEVICEADDR - 1] =
                                _ux_utility_memory_allocate(UX_NO_ALIGN, UX_REGULAR_MEMORY, allocation_size);

                            g_usb_host_usbx_req_msg[module_number].p_tranadr =
                                g_p_usbx_hmsc_dma_buf[USB_DEVICEADDR - 1];
                        }
                    }
   #endif                                                                   /* #if (USB_CFG_DMA == USB_CFG_ENABLE) */
  #endif                                                                    /* #if defined(USB_CFG_HMSC_USE) */
                    g_usb_host_usbx_req_msg[module_number].tranlen  = size; /* Request Data Size */
                    g_usb_host_usbx_req_msg[module_number].complete = usb_host_usbx_transfer_complete_cb;

