TheSovietUnion1970/C_embedded/MICROCONTROLERS/RX65N/USB/RX65N_USB_HMSC/trash/2024-11-27-21-52-49/src/smc_gen/r_usb_basic/src/driver/r_usb_usbx_port.c
                    /* Callback function */
                    g_usb_host_usbx_req_msg[module_number].segment = USB_TRAN_END;
                    g_usb_host_usbx_req_msg[module_number].ip      = module_number;
                    g_usb_host_usbx_req_msg[module_number].ipp     = usb_hstd_get_usb_ip_adr(module_number);
                    g_p_usb_host_actural_length[module_number][pipe_number] =
                        (uint32_t *) &(transfer_request->ux_transfer_request_actual_length);

                    g_p_usb_host_usbx_transfer_request[module_number][pipe_number] = transfer_request;
                    err = usb_hstd_transfer_start(&g_usb_host_usbx_req_msg[module_number]);

                    if (USB_OK == err)
                    {
                        status = (uint32_t) UX_SUCCESS;
                    }
                    else
                    {
                        status = (uint32_t) UX_TRANSFER_ERROR;
                    }

                    break;
                }

                case (uint32_t) UX_PORT_ISOCHRONOUS_ENDPOINT:
                default:
                {
                    break;
                }
            }

            break;
        }

        case (uint32_t) UX_HCD_TRANSFER_ABORT:
        {
            break;
        }

        case (uint32_t) UX_HCD_CREATE_ENDPOINT:
        {
            ((UX_ENDPOINT *) parameter)->ux_endpoint_ed = parameter;

            switch ((((UX_ENDPOINT *) parameter)->ux_endpoint_descriptor.bmAttributes) & UX_PORT_MASK_ENDPOINT_TYPE)
            {
                case (uint32_t) UX_PORT_CONTROL_ENDPOINT:
                {
                    ((UX_ENDPOINT *) parameter)->ux_endpoint_transfer_request.ux_transfer_request_maximum_length =
                        UX_PORT_MAX_CONTROL_PAYLOAD;
                    break;
                }

                case (uint32_t) UX_PORT_BULK_ENDPOINT:
                {
                    ((UX_ENDPOINT *) parameter)->ux_endpoint_transfer_request.ux_transfer_request_maximum_length =
                        UX_PORT_MAX_BULK_PAYLOAD;
                    break;
                }

                case (uint32_t) UX_PORT_INTERRUPT_ENDPOINT:
                {
                    ((UX_ENDPOINT *) parameter)->ux_endpoint_transfer_request.ux_transfer_request_maximum_length =
                        UX_PORT_MAX_INTERRUPT_PAYLOAD;
                    break;
                }

                case (uint32_t) UX_PORT_ISOCHRONOUS_ENDPOINT:
                {
                    ((UX_ENDPOINT *) parameter)->ux_endpoint_transfer_request.ux_transfer_request_maximum_length =
                        UX_PORT_MAX_ISO_PAYLOAD;
                    break;
                }

                default:
                {
                    break;
                }
            }

            status = (uint32_t) UX_SUCCESS;

            break;
        }

        case (uint32_t) UX_HCD_GET_PORT_STATUS:
        {
  #if defined(USB_CFG_OTG_USE)
            uint16_t  port_status = 0;
            uint16_t  reg_dvstctr;
            uint16_t  speed;
            usb_utr_t utr;

            if (USB_MODE_HOST == g_usb_usbmode[module_number])
            {
                utr.ip = module_number;

                reg_dvstctr = hw_usb_read_dvstctr(&utr);

                /* Isolate speed.  */
                speed = reg_dvstctr & (uint16_t) USB_RHST;
                if (USB_NULL != speed)
                {
                    /* Detect Port Device Attached speed.   */
                    switch (speed)
                    {
                        case USB_FSMODE:
                        {
                            port_status |= (ULONG) UX_PS_DS_FS;
                            break;
                        }

                        case USB_HSMODE:
                        {
                            port_status |= (ULONG) UX_PS_DS_HS;
                            break;
                        }

                        default:
                        {
                            port_status |= (ULONG) UX_PS_DS_LS;
                            break;
                        }
                    }

                    /*  Device connection detected .  */
                    port_status |= UX_PS_CCS;

   #if !defined(USB_CFG_OTG_USE)
                    / *Port Enabled. * /
                    hcd_synergy->ux_hcd_synergy_port_status = (ULONG) UX_SYNERGY_HC_PORT_ENABLED;
   #endif                              /* !defined(USB_CFG_OTG_USE) */

                    /* Port Enable Status.  */
                    if (reg_dvstctr & USB_UACT)
                    {
                        port_status |= UX_PS_PES;
                    }

                    port_status |= UX_PS_PPS;
                    status       = (uint32_t) port_status;
                }
                else
                {
                    status = 0;
                }
            }

  #else                                /* defined(USB_CFG_OTG_USE) */
            status = 0;
  #endif                               /* defined(USB_CFG_OTG_USE) */
            break;
        }

        default:
        {
            /* Error trap. */
            _ux_system_error_handler((uint32_t) UX_SYSTEM_LEVEL_THREAD,
                                     (uint32_t) UX_SYSTEM_CONTEXT_HCD,
                                     (uint32_t) UX_FUNCTION_NOT_SUPPORTED);

            /* Unknown request, return an error.  */
            status = (uint32_t) UX_FUNCTION_NOT_SUPPORTED;
            break;
        }
    }

    /* Return completion status.  */
    return status;
}                                      /* End of function usb_host_usbx_to_basic() */

 #endif                                /* ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST) */

 #if defined(USB_CFG_OTG_USE)

/******************************************************************************
 * Function Name   : usb_otg_hnp_swap
 * Description     : OTG swap start processing for USB IP0
 * Argument        : LONG type : UX_OTG_HOST_TO_SLAVE
 * Return          : UX_SUCCESS
 ******************************************************************************/
static UINT usb_otg_hnp_swap (ULONG type)
{
    FSP_PARAMETER_NOT_USED(type);
    usb_utr_t utr;

    g_usb_otg_hnp_process[0] = USB_ON;

    utr.ip = USB_IP0;
    usb_hstd_hcd_snd_mbx(&utr, USB_MSG_HCD_OTG_SUSPEND, 0, (uint16_t *) 0, 0);

    return UX_SUCCESS;
}

  #if USB_NUM_USBIP == 2

/******************************************************************************
 * Function Name   : usb_otg_hnp_swap
 * Description     : OTG swap start processing for USB IP0
 * Argument        : LONG type : UX_OTG_HOST_TO_SLAVE
 * Return          : UX_SUCCESS
 ******************************************************************************/
static UINT usb2_otg_hnp_swap (ULONG type)
{
    FSP_PARAMETER_NOT_USED(type);
    usb_utr_t utr;

    g_usb_otg_hnp_process[1] = USB_ON;

    utr.ip = USB_IP1;
    usb_hstd_hcd_snd_mbx(&utr, USB_MSG_HCD_OTG_SUSPEND, 0, (uint16_t *) 0, 0);

    return UX_SUCCESS;
}

  #endif                               /* USB_NUM_USBIP == 2 */
 #endif
#endif                                 /* #if (BSP_CFG_RTOS_USED == 5) */

/******************************************************************************
 * End  Of File
 ******************************************************************************/
